emirano/routes/web.php

select * from "employers" where "employers"."id" in (1)
select * from "employers" where "employers"."id" in (1, 13, 19, 20)
---
});


Route::get('/jobs', function () {
    $job = Job::with('employer')->latest()->simplePaginate(4);
    return view('jobs.index', ['jobs' => $job]);
});