emirano/app/Http/Controllers/JobController.php

    public function index()
    {
        $job = Job::with('employer')->latest()->paginate(4);
---
select * from "employers" where "employers"."id" in (1, 19, 20, 22)