app/Http/Controllers/RegisteredUserController.php

    public function store(Request $request)
    {
        //    $request->validate([]);dd('user');

        //validate        dd('user');

        $attr = request()->validate([
            "email" => ['required', 'email'],
            "password" =>  ['required', 'confirmed'],
            "first_name" =>  ['required'],
            "last_name" =>  ['required',],
        ]);

        //create user
        $user = User::create($attr);
---
insert into "users" ("email", "password", "first_name", "last_name", "updated_at", "created_at") values ('emiranojoshua@gmail.com', '$2y$12$u8Vy0QzyJ.aTMabWQAWE0elxMynLl8xKqQfHD5m3/QusmeVYDRNdu', 'Emmanuel', 'Joshua', '2024-10-05 19:06:05', '2024-10-05 19:06:05')